Revit 2027 API
BuiltInFailures.StairRampFailures.CannotDrawStairsError Property
 Can't make stairs
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawStairsError { get; }
Public Shared ReadOnly Property CannotDrawStairsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawStairsError {
	FailureDefinitionId^ get ();
}
static member CannotDrawStairsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace